#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation. 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dailydesk/Production-CD/runs/run-uxp6oJYp13x9jyov

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_addon.database will be created
  + resource "heroku_addon" "database" {
      + app_id            = (known after apply)
      + config            = {
          + "sslmode" = "false"
        }
      + config_var_values = (sensitive value)
      + config_vars       = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + plan              = "heroku-postgresql:hobby-dev"
      + provider_id       = (known after apply)
    }

  # heroku_app.app will be created
  + resource "heroku_app" "app" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "dailydesk"
      + region                = "us"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.deploy will be created
  + resource "heroku_build" "deploy" {
      + app_id            = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-nodejs",
        ]
      + id                = (known after apply)
      + local_checksum    = "SHA256:e4450bb1280d0bce367f175e73d8f098027a181c01e387b5d1ec1229850e049b"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "./"
        }
    }

  # heroku_formation.machine_config will be created
  + resource "heroku_formation" "machine_config" {
      + app_id   = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_url = (known after apply)

```
</details>
*Pushed by: @KiranGopalakrishnan, Action: `pull_request`*